#!/usr/bin/env python
# -- coding:utf-8 --
# ------------------------ 
# @author: kyle-luo
# @file: main.py
# @time: 2020/7/7 14:27
# @desc:
# ------------------------
"""
@package:
    
"""

##########################
# - 树莓派小车识别项目
#   - 视觉
#       - 识别箭头颜色：
#           > 使用OpenCV的inRange()方法，提取出红色和绿色
#           > 使用该方法得到的就是二值图像
#       - 识别箭头方向
#           > 得到二值图像后，获得最小外接矩形的坐标
#           > 将矩形按照中线分开左半边和右半边
#           > 分别对两边做轮廓提取
#           > 计算两边得到轮廓的面积，哪边大就是指向哪一边的箭头
#   - 通信
##########################
if __name__ == '__main__':
    pass 
